In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import pickle

In [2]:
from google.colab import drive
drive.mount('/content/drive', force_remount=True)

Mounted at /content/drive

### Load Sales Dataset

In [3]:
dataset = pd.read_csv('/content/drive/My Drive/ml_model_flask/sales.csv')

In [4]:
dataset.head()

    rate  sales_in_first_month  sales_in_second_month  sales_in_third_month
0    NaN                     2                    500                   300
1    NaN                     4                    300                   650
2   four                   600                    200                   400
3   nine                   450                    320                   650
4  seven                   600                    250                   350

In [5]:
dataset['rate'].fillna(0, inplace=True)

dataset['sales_in_first_month'].fillna(dataset['sales_in_first_month'].mean(), inplace=True)

X = dataset.iloc[:, :3]

In [6]:
X.head()

    rate  sales_in_first_month  sales_in_second_month
0      0                     2                    500
1      0                     4                    300
2   four                   600                    200
3   nine                   450                    320
4  seven                   600                    250

In [7]:
def convert_to_int(word):
    word_dict = {'one':1, 'two':2, 'three':3, 'four':4, 'five':5, 'six':6, 'seven':7, 'eight':8,
                'nine':9, 'ten':10, 'eleven':11, 'twelve':12, 'zero':0, 0: 0}
    return word_dict[word]

In [8]:
X['rate'] = X['rate'].apply(lambda x : convert_to_int(x))

y = dataset.iloc[:, -1]

In [9]:
X.head()

   rate  sales_in_first_month  sales_in_second_month
0     0                     2                    500
1     0                     4                    300
2     4                   600                    200
3     9                   450                    320
4     7                   600                    250

In [10]:
y.head()

0    300
1    650
2    400
3    650
4    350
Name: sales_in_third_month, dtype: int64

#### Fit logistic regression model

In [11]:
from sklearn.linear_model import LinearRegression
regressor = LinearRegression()

regressor.fit(X, y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

#### Save Model

In [12]:
pickle.dump(regressor, open('model.pkl','wb'))

#### Test model

In [13]:
model = pickle.load(open('model.pkl','rb'))
print(model.predict([[4, 300, 500]]))

[143.3072588]